pl_0_60X601/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    bottomwall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          60;
        startFace       7080;
    }
    topwall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          60;
        startFace       7140;
    }
    coldwall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          48;
        startFace       7200;
    }
    radinlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          12;
        startFace       7248;
    }
    hotwall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          60;
        startFace       7260;
    }
    frontAndback
    {
        type            empty;
        inGroups        1(empty);
        nFaces          7200;
        startFace       7320;
    }
)

// ************************************************************************* //
