pl_0_60X601/constant/radiationProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      radiationProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

radiation on;

radiationModel  oqfvDOM;

oqfvDOMCoeffs
{
    nPhi        5;          // azimuthal angles in PI/2 on X-Y.(from Y to X)
    nTheta      5;          // polar angles in PI (from Z to X-Y plane)
    tolerance 1e-6;   // convergence criteria for radiation iteration
    maxIter     10; 
    nWeights    1;
}

// Number of flow iterations per radiation iteration
solverFreq 1;

absorptionEmissionModel constantAbsorptionEmission;

constantAbsorptionEmissionCoeffs
{
   absorptivity    absorptivity    [ m^-1 ]         0;
   emissivity      emissivity      [ m^-1 ]         0;
   E               E               [ kg m^-1 s^-3 ] 0;
}
weight  (1);
scatterModel    none;

sootModel       none;

transmissivityModel none;

// ************************************************************************* //
