pl_0_60X601/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions     [0 2 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    radinlet
    {
       type            zeroGradient;
    }
    hotwall
    {
         type            zeroGradient;
    }
    coldwall
    {
        type            zeroGradient;
    }
    topwall
    {
        type            zeroGradient;
    }
    bottomwall
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
    
