pl_0_60X601/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions       [0 2 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
     radinlet
    {
        type           fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }
    hotwall
    {
         type           fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }
    coldwall
    {
         type           fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }
    topwall
    {
        type           fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }
    bottomwall
    {
        type           fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //


