pl_0_60X601/0/IDefault
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      IDefault;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -3 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    radinlet
    {
    
       
        type            collimatedbeam;
         T               T;
        emissivityMode  lookup;
        emissivity      uniform 0.9;
        value           uniform 0;
        Irradiation     1000.0;
        BeamDirection	(0.707107 -0.707107 6.12323e-17); 

        
    
    }
    
    hotwall
    {
        type            opaque;
        T               T;
        emissivityMode  lookup;
        emissivity      uniform 0.9;
        value           uniform 0;

    }
    
    coldwall
    {
        type            opaque;
        T               T;
        emissivityMode  lookup;
        emissivity      uniform 0.9;
        value           uniform 0;

    }
    
    topwall
    {
        type            opaque;
        T               T;
        emissivityMode  lookup;
        emissivity      uniform 0.9;
        value           uniform 0;

    }
    
    bottomwall
    {
        type            opaque;
        T               T;
        emissivityMode  lookup;
        emissivity      uniform 0.9;
        value           uniform 0;
    }
    
    frontAndback
    {
        type            empty;
        
    }

}

// ************************************************************************* //
