pl_0_60X601/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
dimensions      [0 2 -1 0 0 0 0];
//dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
   radinlet
    {
       type            alphatJayatillekeWallFunction;
        Prt             0.85;
        value           uniform 0;
    }
    hotwall
    {
         type            alphatJayatillekeWallFunction;
        Prt             0.85;
        value           uniform 0;
    }
    coldwall
    {
       type            alphatJayatillekeWallFunction;
        Prt             0.85;
        value           uniform 0;
    }
    topwall
    {
        type            alphatJayatillekeWallFunction;
        Prt             0.85;
        value           uniform 0;
    }
    bottomwall
    {
        type            alphatJayatillekeWallFunction;
        Prt             0.85;
        value           uniform 0;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //

   
